In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {"name" : ['ajay','mark','sara','zaira','sachin','rahul','pooja','smith','laxmi','michael'] , "age" : [32,40,16,34,55,40,20,15,55,15] , "gender" : ['m','m','f','f','m','m','f','m','f','m'] , "sport" : ['football','neither','cricket','cricket','neither','cricket','neither','cricket','football','football']}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

      name  age gender     sport
0     ajay   32      m  football
1     mark   40      m   neither
2     sara   16      f   cricket
3    zaira   34      f   cricket
4   sachin   55      m   neither
5    rahul   40      m   cricket
6    pooja   20      f   neither
7    smith   15      m   cricket
8    laxmi   55      f  football
9  michael   15      m  football

In [5]:
df['gender'].replace({"m": 0, "f": 1}, inplace=True)

In [6]:
df['sport'].replace({'football': 0,'neither': 1,'cricket': 2}, inplace=True)

In [7]:
df

      name  age  gender  sport
0     ajay   32       0      0
1     mark   40       0      1
2     sara   16       1      2
3    zaira   34       1      2
4   sachin   55       0      1
5    rahul   40       0      2
6    pooja   20       1      1
7    smith   15       0      2
8    laxmi   55       1      0
9  michael   15       0      0

# Predicting label for someone of age 5 (female) , K = 3

In [8]:
age = int(input("enter the age : "))
gen = int(input("enter the gender : "))

enter the age : 5
enter the gender : 1

In [9]:
df['dist'] = np.sqrt((df['age'] - age)**2 +  (df['gender'] - gen)**2)

In [10]:
df

      name  age  gender  sport       dist
0     ajay   32       0      0  27.018512
1     mark   40       0      1  35.014283
2     sara   16       1      2  11.000000
3    zaira   34       1      2  29.000000
4   sachin   55       0      1  50.009999
5    rahul   40       0      2  35.014283
6    pooja   20       1      1  15.000000
7    smith   15       0      2  10.049876
8    laxmi   55       1      0  50.000000
9  michael   15       0      0  10.049876

# SORTED FOR FINDING LABEL

In [11]:
new_df = df.sort_values(by=['dist'])

In [12]:
new_df

      name  age  gender  sport       dist
7    smith   15       0      2  10.049876
9  michael   15       0      0  10.049876
2     sara   16       1      2  11.000000
6    pooja   20       1      1  15.000000
0     ajay   32       0      0  27.018512
3    zaira   34       1      2  29.000000
1     mark   40       0      1  35.014283
5    rahul   40       0      2  35.014283
8    laxmi   55       1      0  50.000000
4   sachin   55       0      1  50.009999

In [13]:
k = int(input("enter th value of k : "))

enter th value of k : 3

In [14]:
data = new_df.head(k)

In [15]:
data

      name  age  gender  sport       dist
7    smith   15       0      2  10.049876
9  michael   15       0      0  10.049876
2     sara   16       1      2  11.000000

In [16]:
data['sport'].value_counts()

2    2
0    1
Name: sport, dtype: int64

In [17]:
#occurence of 2 i.e. cricket is largest 
#so the label is cricket

In [18]:
a = (data.sport == 0).sum()
b = (data.sport == 1).sum()
c = (data.sport == 2).sum()

In [19]:
print(a,b,c)
print("label is : ",max(a,b,c))

1 0 2
label is :  2